Revit 2026 API

# LoadType Enumeration

---

This enum declares types of Loads.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum LoadType
```
```vb
Public Enumeration LoadType
```
```cpp
public enum class LoadType
```
```fsharp
type LoadType
```

| Member name | Value | Description |
| --- | --- | --- |
| Area | 2 | Area Load |
| Line | 1 | Line Load |
| Point | 0 | Point Load |

#### Reference

Autodesk.Revit.DB.Structure Namespace